# DLDSetLoadDataBool

## Description
Using selector, sets default load data with boolean value for the parametric object.
Available selectors : kDLDSelectorInclude = 1, kDLDSelHandlePosTransf = 10.

```pascal
PROCEDURE DLDSetLoadDataBool(
				selector : INTEGER;
				value    : BOOLEAN);
```

```python
def vs.DLDSetLoadDataBool(selector, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|selector|INTEGER|   |
|value|BOOLEAN|   |

## Version
Availability: from Vectorworks 2018

## Category
* Truss Analysis